{
    "welcome":"<p>Alice’s Nightmare in Wonderland is a curious sort of a book. In fact, it is a portal to another world, the dream-world of Wonderland. As well as the book itself, you will need two dice (or a standard pack of playing cards), a pencil and an eraser. Using these tools, and a simple set of game rules contained within the book, you will guide the eponymous heroine of Lewis Carroll’s Alice’s Adventure in Wonderland on a new and perilous quest as she finds herself called upon to save the world of playing cards and talking animals from the increasingly deranged Queen of Hearts.</p><br/><p>Have you ever wondered what would have happened if Alice had not drunk from the bottle labelled ‘Drink Me’, or if she had not joined the Hatter, the March Hare, and the Dormouse for tea? Well now you can find out. In Alice’s Nightmare in Wonderland, YOU decide which route Alice should take, which perils to risk, and which of Wonderland’s strange denizens to fight. But be warned – whether Alice succeeds in her quest or meets a dire end as the nightmare escalates will be down to the choices YOU make.</p><br/><p>Are you ready to go back down the rabbit-hole?</p>",

    "welcome_disclaimer": "<p>This is a digitization of the gamebook by <a href=\"http://jonathangreenauthor.blogspot.com/\" target=\"blank\">Jonathan Green</a> and published by <a href=\"https://www.snowbooks.com/books/alices-nightmare-in-wonderland/\" target=\"_blank\">Snowbooks Ltd<a/>, with original illustrations by Kev Crossley. This is only a sample containing the first steps of the game. All rights to the content belong to the author and the publisher. </p>",

    "intro": [
      {"quote": "\"What a strange world we line in\"",
        "title": "Introduction",
        "content": "<p>The book you hold in your hands is a gateway to another world, the dream-world of Wonderland. Once inside its pages and you will find yourself falling down the rabbit-hole to embark upon a thrilling adventure.</p><br/><p>You see, this is no ordinary book. Rather than reading it from cover to cover, you will discover that at the end of each narrative section you will be presented with a series of choices which allow you to control the course of the story.</p><br/><p>In Alice’s Nightmare in Wonderland you guide the eponymous heroine of Alice’s Adventures in Wonderland, by Lewis Carroll, through a nightmarish dreamscape to the conclusion of her quest. You decide which path to take, which risks to brave, and even which of the weird inhabitants of Wonderland you will meet along the way to engage in battle.</p><br/><p>Success is by no means certain and you may well fail to complete the adventure at your first attempt. However, with experience, skill, and maybe even a little luck, each new attempt should bring you closer to your ultimate goal.</p>"
    },
        {"quote": "\"We're all mad here!\"",
        "title": "Alice’s Attributes",
        "content": "<p>Alice has five attributes you will need to keep track of during the course of the adventure, using Alice’s Adventure Sheet. Some of these will change frequently, some less so, but it is important that you keep an accurate record of the current level for all of them.</p><br/><ul><li><span className=\"font-medium\">Agility</span> – This is a measure of how athletic and agile Alice is. If she needs to leap across a chasm or dodge a deadly projectile, this is the attribute that will be employed.</li><li><span className=\"font-medium\">Logic</span> – This is a measure of how clever and knowledgeable Alice is, and will be tested if Alice ever has to think her way out of a tricky situation or solve a mind-bending puzzle.</li><li><span className=\"font-medium\">Insanity</span> – The deeper Alice plunges into the nightmare that is besetting Wonderland, the more her sanity will be put at risk. Rest assured that you should do all you can to prevent Alice from losing her marbles altogether during the course of the adventure.</li><li><span className=\"font-medium\">Combat</span> – This is a measure of how skilful Alice is at fighting, whether it be in pugilist fashion with her fists, or wielding a keen-edged blade in battle.</li><li><span className=\"font-medium\">Endurance</span> – This is a measure of how physically tough Alice is and how much strength she has left. This attribute will vary more than any other during the course of Alice’s adventure.</li></ul><br/><p>Although there are limits on how high each of Alice’s attributes can be at the start of the adventure, there is no limit as to how high any of Alice’s attributes can be raised during the course of the adventure, dependent upon bonus points Alice may be awarded. However, should Alice’s Endurance score ever drop to zero, or below, then her adventure is over and you should stop reading immediately; if you want to tackle the quest again, you will have to start from the beginning, determining Alice’s attributes anew, and then starting the story from section 1 once more.</p>"
    },
        {"quote": "\"Do you play Croquet?\"",
        "title": "Testing Alice’s Attributes",
        "content": "<p>At various times during the adventure, you will be asked to test one or other of Alice’s attributes.</p></p>If it is Alice’s <span className=\"italic\">Agility, Logic or Combat</span> that is being tested, simply roll two dice. If the total rolled is equal to or less than the particular attribute being tested, Alice has passed the test; if the total rolled is greater than the attribute in question, then Alice has failed the test.</p><br/><p>If it is Alice’s Endurance score that is being tested, roll four dice in total. If the combined score of all four dice is equal to or less than Alice’s <span className=\"italic\">Endurance</span> score, then she has passed the test, but if it is greater, then what is being asked of her is beyond what she is capable of and she has failed the test.</p><br/><p>If it is Alice’s <span className=\"italic\">Insanity</span> score that is being tested, roll two dice, and in this case, if the total rolled is less than her Insanity score, Alice has failed the test. However, if the total rolled is equal to or greater than her Insanity score, then Alice has passed the test.</p>"
    },
        {"quote": "\"It's always tea-time\"",
        "title": "Restoring Alice’s Attributes",
        "content": "<p>There are various ways that Alice can restore lost attribute points, or be granted bonuses that take her attributes beyond their starting scores, and these will be described in the text.</p><br/><p>However, an easy way to restore lost <span className=\"italic\">Endurance</span> points is to find things for Alice to eat and drink. Sometimes Alice may find enough food that she can make herself some provisions to take with her for later on in the adventure.</p><br/><pMake sure that if Alice does find any supplies of this nature that you record them on Alice’s Adventure Sheet, along with any information about exactly how many attribute points they will restore when consumed.</p>"
    },
        {"quote": "\"Curioser and curioser!\"",
        "title": "Alice’s Special Abilities",
        "content": "<p>In addition to her five basic attributes, Alice also has two special abilities that she can employ at critical moments during her journey through the nightmarish Wonderland.</p><br/><ul><li><span className=\"font-medium\">Curiouser and Curiouser</span> – If Alice finds herself in a tight spot she can use this ability to change the nature of the dream world around her, although this might result in her actually making things worse rather than better.</li><li><span className=\"font-medium\">The Pen is Mightier</span> – This ability allows Alice to avoid coming to blows with an enemy, by altering the narrative of the encounter and thereby enabling her to get away unscathed.</li></ul><br/><p>These very special abilities can only be used three times each during the course of the adventure. Each time Alice’s calls on one of them, you must cross off a box on Alice’s Adventure Sheet under the appropriate special ability.</p>"
    },
        {"quote": "\"Off with her head!\"",
        "title": "Combat",
        "content": "<p>Alice will repeatedly be called upon to defend herself against the bizarre and malevolent denizens of the nightmarish realm that Wonderland has become since her last visit. Sometimes she may even choose to attack these horrors herself. After all, as they say, the best form of defence is attack.</p><br/><p>Whenever Alice engages in combat, you will be told in the text whether Alice or her enemy has the initiative; in other words, who has the advantage and gets to attack first.</p><br/><ol type=\"1\"><li>Roll two dice and add Alice’s Combat score. The resulting total is Alice’s Combat Rating.</li><li>Roll two dice and add Alice’s opponent’s Combat Score. The resulting total is her opponent’s Combat Rating.</li><li>For each Combat Round, add a temporary 1 point bonus to the Combat Rating of whichever of the combatants has the initiative for the duration of that round.</li><li>If Alice’s Combat Rating is higher than her opponent’s she has wounded her enemy; deduct 2 points from her opponent’s Endurance score, and move on to step 7.</li><li>If Alice’s opponent’s Combat Rating is higher, then Alice has been wounded; deduct 2 points from Alice’s Endurance score, and move on to step 8.</li><li>If Alice’s Combat Rating and her opponent’s Combat Rating are the same, roll one die. If the number rolled is odd, Alice and her opponent deflect each other’s attacks; go to step 10. If the number rolled is even, go to step 9.</li><li>If Alice’s opponent’s Endurance score has been reduced to zero or below, Alice has won; the battle is over and she can continue on her way through Wonderland. If her opponent is not yet dead, go to step 10.</li><li>If Alice’s Endurance score has been reduced to zero or below, Alice’s opponent has won the battle. If you want to continue your adventure you will have to start again from the beginning, determining Alice’s attributes all over again, and starting from section 1 once more. If Alice is still alive, go to step 10.</li><li>Alice and her opponent have both managed to injure each other; deduct 1 point from their respective Endurance scores. If Alice’s Endurance score has been reduced to zero or below, Alice’s adventure is over; if you want to play again you will have to determine Alice’s attributes anew, and start again from section 1. If Alice is still alive but her enemy’s Endurance has been reduced to zero or below, Alice has won; the battle is over and she can continue on her way through Wonderland. If neither Alice nor her opponent are dead, go to step 10.</li><li>If Alice won the Combat Round, she will have the initiative in the next Combat Round. If her opponent won the Combat Round, they will have the initiative. If neither of them won the Combat Round, neither of them will gain the initiative bonus for the next Combat Round. Go back to step 1 and work through the sequence again until either Alice, or her opponent, is defeated.</li></ol><br/><p>Occasionally Alice may find herself having to fight more than one opponent at once. Such battles are conducted in the same way as above, using the ten step process, except that you will have to work out the Combat Ratings of all those involved. As long as Alice has a higher rating than an opponent she will injure them, no matter how many opponents she is taking on at the same time. However, equally, any opponent with a Combat Rating higher than Alice’s will be able to injure her too.</p>"
    },
        {"quote": "\"Shoes, and ships, and sealing wax\"",
        "title": "Equipment",
        "content": "<p>Alice starts her adventure with nothing but the clothes she stands up in, including a pinafore she wears over her dress which, fortunately, comes with a deep pocket at the front. This is where Alice stores anything she picks up during the course of her adventure.<p><br/><p>Anything that she collects should be recorded on Alice’s Adventure Sheet, including any clues or passwords, as well as weapons, provisions, and other miscellaneous unusual items.</p>"
    },
        {"quote": "\"Begin at the beginning\"",
        "title": "Hints on Play",
        "content": "<p>There is more than one path that Alice can follow through Wonderland to reach her ultimate goal, but it may take you several attempts to actually complete the adventure. Make notes and draw a map as you explore. This map will doubtless prove invaluable during future attempts at completing the quest, and will allow you to progress more speedily in order to reach unexplored regions of the nightmarish realm.<p><br/><p>Keep a careful eye on all of Alice’s attributes and her <span className=\"italic\">Insanity</span> score in particular. Beware of traps and of sending Alice on too many wild goose chases. However, it would be wise to collect useful items along the way that may aid her further on in her quest.</p>"
    },
        {"quote": "\"Go on till you come to the end. The stop.\"",
        "title": "Ending the Game",
        "content": "<p>There are several ways that Alice’s adventure can end. If her <span>Endurance</span> score ever drops to zero or below, her trials in Wonderland have exhausted and overcome her. If this happens, stop reading at once. There may also be occasions where Alice is prevented from progressing any further through the adventure thanks to the choices you have made for her, or she meets a sudden and untimely end. In all of these cases, if you want to have another crack at completing the adventure you will have to start again with a new Alice’s Adventure Sheet and begin the story afresh from section 1.<p><br/><p>There is of course one other reason for Alice’s adventure coming to an end, and that is if she successfully completes her quest, the very same quest that awaits her now…</p>"
    }
    ],

  "attributes": "<p>Unlike some adventure gamebooks, in Alice's Nightmare in Wonderland Alice's strengths and weaknesses are not determined randomly. Instead, you get to decide what she is good at and, conversely, what she might not be so good at.</p><br/><p>Alice’s Insanity score always starts at zero. Her Endurance score always starts at 20.</p><br/><p>Alice’s remaining attributes – Agility , Logic and Combat – start at a base level of 6. You then have a pool of 10 extra points to share out between Agility , Logic , Combat and Endurance as you see fit, but you can only add up to 5 points to each attribute. So the maximum starting score for Agility , Logic , and Combat is 11, and the maximum starting score for Endurance is 25. (You must apportion all 10 points one way or another, and cannot leave any unused.)</p><br><p className=\"text-sm\">For example, you might choose to add 2 points to Alice’s Agility score, 4 to her Logic score, 2 points to her Combat score, and add the remaining 2 points to her Endurance score, which would give Alice the following starting profile for the game: Agility = 8, Logic = 10, Insanity = 0, Combat = 8, Endurance = 22.</p>"
}